Repository: szgabsz91/iit-szg
Catalog: src/locale/messages.*.xlf
Languages: hu

# appMenuToggle
source: Toggle menu
hu: Menü

# appLanguageSelectorToggle
source: Language selector
hu: Nyelvválasztó

# appLanguageSelector
source: { locale, select, hu {Hungarian} en {English} other {} }
hu: { locale, select, hu {Magyar} en {Angol} other {} }

source: { VAR_SELECT, select, hu {Hungarian} en {English} other {} }
hu: { VAR_SELECT, select, hu {Magyar} en {Angol} other {} }

# appMenuHome
source: Home
hu: Főoldal

# appCourseIndex
source: Index
hu: Lista

# appFooter
source: © Gabor Szabo {{ currentYear }}
hu: © Szabó Gábor {{ currentYear }}

# courseTableHeaderTitle
source: Title
hu: Cím

# homeTitle
source: Home
hu: Főoldal

# homeParagraph1
source: This application is a collection of courses of various topics. Each course contains a set of labs. The labs are recommended to be completed in order.
hu: Ez az alkalmazás különböző kurzusokat tartalmaz változó témákban. Minden kurzus gyakorlati anyagokból áll, melyeket ajánlott a megadott sorrendben elvégezni.

# homeParagraph2
source: Currently there are two courses:
hu: Jelenleg az alkalmazás két kurzust tartalmaz:

# homeCoursesXml
source: <a routerLink="courses/xml">XML</a>: contains topics such as XDM, DTD, XML Schema, XML related Java and C# APIs, JSON, RSS, XHTML, XPath, XSLT, XQuery and XML DB.
hu: <a routerLink="courses/xml">XML</a>: olyan témaköröket érint, mint az XDM, DTD, XML Schema, XML-hez kapcsolódó Java and C# API-k, JSON, RSS, XHTML, XPath, XSLT, XQuery és XML DB.

# homeCoursesDatabases
source: <a routerLink="courses/db">Databases</a>: contains topics such as LDAP, JPA, LINQ, ORDBMS, MongoDB, Neo4j and ontologies.
hu: <a routerLink="courses/db">Adatbázisok</a>: olyan témaköröket érint, mint az LDAP, JPA, LINQ, ORDBMS, MongoDB, Neo4j és ontológiák.

# homeParagraph3
source: Each course starts with a <em>Prerequisites</em> virtual lab that introduces the necessary applications and how to set them up. The labs after that contain exercises for the given topics, as well as a solution project that can be used for verification purposes. However, it is recommended to solve the exercises without taking a look at the solution.
hu: Minden kurzus egy <em>Előfeltételek</em> anyaggal kezdődik, ami bemutatja a szükséges alkalmazásokat és azok beállítását. Ezek után a gyakorlati anyagokban találhatóak a feladatok, témakörönként csoportosítva. Minden gyakorlati anyag végén megtalálható egy lehetséges megoldása a feladatoknak, de ettől függetlenül ajánlott a feladatokat a megoldás nélkül megoldani.

# labTitle
source: Lab {{ lab.index }}: {{ lab.titles.long }}
hu: {{ lab.index }}. gyakorlat: {{ lab.titles.long }}

# appTitlesHome
source: Home
hu: Főoldal

# appTitlesCourse
source: course.name Course
hu: course.name

source: IIT-SZG is an application that consists of software engineering related courses. Each course contains a set of labs and their solutions. Currently there are two courses: XML and Databases.
hu: Az IIT-SZG egy olyan alkalmazás, amely szoftverfejlesztéssel kapcsolatos kurzusokat tartalmaz. Minden kurzus gyakorlatokból áll. Jelenleg két kurzus található az alkalmazásban: az XML és az Adatbázisok kurzus.

# appSeoKeywordIitGaborSzabo
source: Gabor Szabo
hu: Szabó Gábor

# appSeoKeywordInformationTechnology
source: information technology
hu: informatika

# appSeoKeywordSoftwareEngineering
source: software engineering
hu: szoftverfejlesztés

# appSeoKeywordCourse
source: course
hu: kurzus

# appSeoKeywordLab
source: lab
hu: gyakorlat

# appSeoKeywordCoursesDatabases
source: Databases
hu: Adatbázisok
